#Напишите 4 переменных которые буду обозначать следующие данные:
#Количество выполненных ДЗ (запишите значение 12)
#Количество затраченных часов (запишите значение 1.5)
#Название курса (запишите значение 'Python')
#Время на одно задание (вычислить используя 1 и 2 переменные)
#Выведите на экран(в консоль), используя переменные, следующую строку:
#Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.
kolvo_DZ = 12
zatrat_ch = 1.5
kurs = 'Python'
Time_na_1z = zatrat_ch/ kolvo_DZ

print ('#Курс:', kurs + ',', 'всего задач:', str(kolvo_DZ) + ',',  'затрачено часов:', str(zatrat_ch) + '.', 'среднее время выполнения', Time_na_1z, 'часа.' )