'''В первом поле камни с числом менялись постоянно (от 3 до 20) случайным образом, а второе было всегда пустым.
Во вторую вставку нужно было написать те пары чисел друг за другом, чтобы число из первой вставки было
кратно(делилось без остатка) сумме их значений.
Все пароли для чисел от 3 до 20 (для сверки):
3 - 12
4 - 13
5 - 1423
6 - 121524
7 - 162534
8 - 13172635
9 - 1218273645
10 - 141923283746
11 - 11029384756
12 - 12131511124210394857
13 - 112211310495867
14 - 1611325212343114105968
15 - 1214114232133124115106978
16 - 1317115262143531341251161079
17 - 11621531441351261171089
18 - 12151811724272163631545414513612711810
19 - 118217316415514613712811910
20 - 13141911923282183731746416515614713812911
'''
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15,16,17,18,19,20]
n = int(input('Введите число от 3 до 20: '))
result = []
f = 0
if n < 3 or n > 20:
    print('Неверное число, Введите число от 3 до 20 ')
else:
    for i in numbers:
        for j in range(1, i):
            f = i + j
            if n % f == 0:
                result.append(j)
                result.append(i)
print('Сумма этих пар чисел, кратна введеному вами числу:', *result)